In [10]:
import pandas as pd

In [11]:
import numpy as np

In [15]:
arr = np.array([[1, 2, 3], [4, 5, 6]])
df = pd.DataFrame(arr,columns=['col 1','col 2','col 3'])

In [23]:
df

   col 1  col 2  col 3
0      1      2      3
1      4      5      6

In [17]:
df.columns

Index(['col 1', 'col 2', 'col 3'], dtype='object')

In [18]:
df['col 2']

0    2
1    5
Name: col 2, dtype: int64

In [12]:
s1 = pd.Series(np.random.randn(5),index=['A','B','C','D','E'])

In [13]:
s2 = pd.Series(np.random.randn(5),index=['A','B','C','D','E'])

In [15]:
s2

A    0.010143
B   -0.078778
C   -0.258743
D   -0.486065
E   -0.087364
dtype: float64

In [20]:
df = pd.concat([s1, s2],axis=1).reset_index()

In [29]:
s2.to_frame()

          0
A  0.010143
B -0.078778
C -0.258743
D -0.486065
E -0.087364

In [9]:
my_df = pd.DataFrame(np.random.randn(25).reshape((5,5)),index=['a','b','c','d','e'],columns=['c1','c2','c3','c4','c5'])

In [75]:
my_df

         c1        c2        c3        c4        c5
a  1.100057  0.055049  0.226894 -0.212394  0.121284
b -0.815368 -1.523775  0.695376  0.556949 -1.135506
c  2.365687  1.045582  0.703111 -0.270769 -0.313596
d -0.247526 -0.079318  2.058571 -0.168283 -0.124014
e  0.688753 -1.236124 -0.185109 -0.745150 -1.345342

In [85]:
my_df.drop('c2',axis=1,inplace=True)

In [121]:
my_df

        col1      col2      col3      col4
r1  1.100057  0.226894 -0.212394  0.121284
r2 -0.815368  0.695376  0.556949 -1.135506
r3  2.365687  0.703111 -0.270769 -0.313596
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342

In [120]:
my_df.columns = ['col1', 'col2', 'col3', 'col4']

In [126]:
my_df.loc['r1']['col2']

0.22689392096827091

In [127]:
my_df.iloc[0][1]

0.22689392096827091

In [128]:
my_df.iloc[0,1]

0.22689392096827091

In [134]:
my_df

        col1      col2      col3      col4
r1  1.100057  0.226894 -0.212394  0.121284
r2 -0.815368  0.695376  0.556949 -1.135506
r3  2.365687  0.703111 -0.270769 -0.313596
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342

In [158]:
my_df

        col1      col2      col3      col4
r1  1.100057  0.226894 -0.212394  0.121284
r2 -0.815368  0.695376  0.556949 -1.135506
r3  2.365687  0.703111 -0.270769 -0.313596
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342

In [184]:
my_df.sort_values(by=['col1','col4'])

        col1      col2      col3      col4
r2 -0.815368  0.695376  0.556949 -1.135506
r4 -0.247526  2.058571 -0.168283 -0.124014
r5  0.688753 -0.185109 -0.745150 -1.345342
r1  1.100057  0.226894 -0.212394  0.121284
r3  2.365687  0.703111 -0.270769 -0.313596

In [185]:
data = {'first_name': ['Noureddin', 'Josef', 'Mike', 'Ali', 'Luke'],
        'last_name': ['Sadawi', 'Baker', 'Brooks', 'Shah', 'Brown'],
        'year': [2015, 2009, 2013, 2016, 2014],
        'score': [422, 322, 233, 223, 401]
        }
df = pd.DataFrame(data, index = ['Tripoli', 'Birmingham', 'London', 'Islamabad', 'New York'])
df

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    422  2015
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
Islamabad         Ali      Shah    223  2016
New York         Luke     Brown    401  2014

In [187]:
df.sort_values(by='last_name', ascending=True)

           first_name last_name  score  year
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
New York         Luke     Brown    401  2014
Tripoli     Noureddin    Sadawi    422  2015
Islamabad         Ali      Shah    223  2016

In [188]:
df.sort_values(by=['last_name','score'])

           first_name last_name  score  year
Birmingham      Josef     Baker    322  2009
London           Mike    Brooks    233  2013
New York         Luke     Brown    401  2014
Tripoli     Noureddin    Sadawi    422  2015
Islamabad         Ali      Shah    223  2016

In [196]:
m = df[df < 240]

In [197]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    NaN   NaN
Birmingham      Josef     Baker    NaN   NaN
London           Mike    Brooks  233.0   NaN
Islamabad         Ali      Shah  223.0   NaN
New York         Luke     Brown    NaN   NaN

In [202]:
m.dropna(how='all',axis=1,thresh=3)

           first_name last_name
Tripoli     Noureddin    Sadawi
Birmingham      Josef     Baker
London           Mike    Brooks
Islamabad         Ali      Shah
New York         Luke     Brown

In [203]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    NaN   NaN
Birmingham      Josef     Baker    NaN   NaN
London           Mike    Brooks  233.0   NaN
Islamabad         Ali      Shah  223.0   NaN
New York         Luke     Brown    NaN   NaN

In [206]:
m.fillna(1,inplace=True)

In [207]:
m

           first_name last_name  score  year
Tripoli     Noureddin    Sadawi    1.0   1.0
Birmingham      Josef     Baker    1.0   1.0
London           Mike    Brooks  233.0   1.0
Islamabad         Ali      Shah  223.0   1.0
New York         Luke     Brown    1.0   1.0